Repository: xkelxmc/keypress-macos
Catalog: Sources/Keypress/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ru

# theme.modern
source: Modern
de: Zeitgemäß
es: Moderno
fr: Moderne
ru: Современная

# theme.mono
source: Mono
de: Monochrom
es: Monocromo
fr: Monochrome
ru: Монохромная

# theme.neon
source: Neon
de: Neonfarben
es: Neón
fr: Néon
ru: Неоновая

# unit.seconds
source: s
de: Sek.
es: seg
fr: sec.
ru: с

# keyboard.appearance.subtitle
source: Choose a visual style and refine the keyboard overlay.
de: Wählen Sie einen visuellen Stil und verfeinern Sie das Tastatur-Overlay.
es: Elige un estilo visual y ajusta la superposición del teclado.
fr: Choisissez un style visuel et affinez la superposition du clavier.
ru: Выберите визуальный стиль и настройте оверлей клавиатуры.

# keyboard.appearance.title
source: Keyboard Appearance
de: Tastaturdarstellung
es: Apariencia del teclado
fr: Apparence du clavier
ru: Оформление клавиатуры

# pointer.appearance.reset
source: Reset Pointer Theme
de: Zeigerdesign zurücksetzen
es: Restablecer tema del puntero
fr: Réinitialiser le thème du pointeur
ru: Сбросить тему указателя

# pointer.appearance.reset.confirm.message
source: This restores the Custom pointer theme to its default values.
de: Dadurch wird das eigene Zeigerdesign auf die Standardwerte zurückgesetzt.
es: Esto restaura el tema personalizado del puntero a sus valores predeterminados.
fr: Cette action rétablit les valeurs par défaut du thème personnalisé du pointeur.
ru: Своя тема указателя будет возвращена к значениям по умолчанию.

# pointer.appearance.reset.confirm.title
source: Reset Pointer Theme?
de: Zeigerdesign zurücksetzen?
es: ¿Restablecer tema del puntero?
fr: Réinitialiser le thème du pointeur ?
ru: Сбросить тему указателя?

# pointer.appearance.subtitle
source: Choose the shape, glow, colors, and motion of the pointer halo.
de: Form, Leuchten, Farben und Bewegung des Zeigereffekts gestalten.
es: Elige la forma, el resplandor, los colores y el movimiento del halo del puntero.
fr: Choisissez la forme, la lueur, les couleurs et le mouvement du halo du pointeur.
ru: Настройте форму, свечение, цвета и движение подсветки указателя.

# pointer.appearance.title
source: Pointer Appearance
de: Zeigerdarstellung
es: Apariencia del puntero
fr: Apparence du pointeur
ru: Оформление указателя

# pointer.preview.try
source: Try pointer reactions
de: Zeigerreaktionen ausprobieren
es: Prueba las reacciones del puntero
fr: Essayez les réactions du pointeur
ru: Попробуйте реакции указателя

# sidebar.section.keyboard
source: Keyboard
de: Tastatur
es: Teclado
fr: Clavier
ru: Клавиатура

# sidebar.section.pointer
source: Pointer
de: Zeiger
es: Puntero
fr: Pointeur
ru: Указатель

# sidebar.settings
source: Settings
de: Einstellungen
es: Ajustes
fr: Réglages
ru: Настройки

# about.release.all
source: View All Release Notes
de: Alle Versionshinweise anzeigen
es: Ver todas las notas de la versión
fr: Afficher toutes les notes de version
ru: Все примечания к выпускам

# keyboard.disabled.action
source: Open Keyboard Settings
de: Tastatureinstellungen öffnen
es: Abrir ajustes del teclado
fr: Ouvrir les réglages du clavier
ru: Открыть настройки клавиатуры

# keyboard.disabled.subtitle
source: Turn on the keyboard overlay to configure its appearance and position.
de: Aktiviere das Tastatur-Overlay, um Darstellung und Position zu konfigurieren.
es: Activa la superposición del teclado para configurar su apariencia y posición.
fr: Activez la surcouche clavier pour régler son apparence et sa position.
ru: Включите оверлей клавиатуры, чтобы настроить его оформление и позицию.

# keyboard.disabled.title
source: Keyboard Overlay Is Off
de: Tastatur-Overlay ist aus
es: La superposición del teclado está desactivada
fr: La surcouche clavier est désactivée
ru: Оверлей клавиатуры выключен

# pointer.decoration.centerDot
source: Center Dot
de: Mittelpunkt
es: Punto central
fr: Point central
ru: Точка в центре

# pointer.decoration.cornerBrackets
source: Corners
de: Ecken
es: Esquinas
fr: Coins
ru: Уголки

# pointer.decoration.crosshair
source: Crosshair
de: Fadenkreuz
es: Retícula
fr: Réticule
ru: Перекрестие

# pointer.decoration.innerRing
source: Inner Ring
de: Innenring
es: Anillo interior
fr: Anneau intérieur
ru: Внутреннее кольцо

# pointer.decoration.none
source: None
de: Keine
es: Ninguno
fr: Aucun
ru: Нет

# pointer.decoration.orbit
source: Orbit
de: Umlaufbahn
es: Órbita
fr: Orbite
ru: Орбита

# pointer.disabled.action
source: Open Pointer Settings
de: Zeigereinstellungen öffnen
es: Abrir ajustes del puntero
fr: Ouvrir les réglages du pointeur
ru: Открыть настройки указателя

# pointer.disabled.subtitle
source: Turn on the pointer overlay to configure its theme and effects.
de: Aktiviere das Zeiger-Overlay, um Design und Effekte zu konfigurieren.
es: Activa la superposición del puntero para configurar su tema y efectos.
fr: Activez la surcouche du pointeur pour régler son thème et ses effets.
ru: Включите оверлей указателя, чтобы настроить его тему и эффекты.

# pointer.disabled.title
source: Pointer Overlay Is Off
de: Zeiger-Overlay ist aus
es: La superposición del puntero está desactivada
fr: La surcouche du pointeur est désactivée
ru: Оверлей указателя выключен

# pointer.lineStyle
source: Line Style
de: Linienstil
es: Estilo de línea
fr: Style de ligne
ru: Стиль линии

# pointer.lineStyle.double
source: Double
de: Doppelt
es: Doble
ru: Двойная

# pointer.lineStyle.neonDepth
source: Neon Depth
de: Neontiefe
es: Profundidad neón
fr: Profondeur néon
ru: Неоновая глубина

# pointer.lineStyle.segmented
source: Segmented
de: Segmentiert
es: Segmentada
fr: Segmenté
ru: Сегментированная

# pointer.lineStyle.solid
source: Solid
de: Durchgehend
es: Continua
fr: Continue
ru: Сплошная

# preview.pressed
source: Pressed
de: Gedrückt
es: Pulsado
fr: Enfoncé
ru: Нажатие

# preview.resting
source: Resting
de: Ruhend
es: Reposo
fr: Au repos
ru: Покой

# onboarding.back
source: Back
de: Zurück
es: Atrás
fr: Retour
ru: Назад

# onboarding.ceremony.skip
source: Click or press Space to continue
de: Klicken oder Leertaste drücken, um fortzufahren
es: Haz clic o pulsa Espacio para continuar
fr: Cliquez ou appuyez sur Espace pour continuer
ru: Нажмите мышью или пробел, чтобы продолжить

# onboarding.ceremony.subtitle
source: Your input, made visible.
de: Deine Eingabe. Sichtbar gemacht.
es: Tus acciones, ahora visibles.
fr: Vos actions deviennent visibles.
ru: Ваши действия становятся видимыми.

# onboarding.ceremony.title
source: Meet Keypress
de: Lerne Keypress kennen
es: Descubre Keypress
fr: Découvrez Keypress
ru: Знакомьтесь: Keypress

# onboarding.keyboard.horizontal
source: Horizontal History
de: Horizontaler Verlauf
es: Historial horizontal
fr: Historique horizontal
ru: История в строку

# onboarding.keyboard.latest
source: Latest
de: Zuletzt
es: Última
fr: Dernière
ru: Последняя

# onboarding.keyboard.replay
source: Replay key press
de: Tastendruck wiederholen
es: Repetir pulsación
fr: Rejouer l’appui
ru: Повторить нажатие

# onboarding.keyboard.stacked
source: Stacked History
de: Gestapelter Verlauf
es: Historial apilado
fr: Historique empilé
ru: История стопкой

# onboarding.keyboard.subtitle
source: Choose how your keyboard story appears on screen.
de: Wähle, wie deine Tastatureingaben auf dem Bildschirm erscheinen.
es: Elige cómo se muestra tu teclado en pantalla.
fr: Choisissez comment votre clavier apparaît à l’écran.
ru: Выберите, как история нажатий выглядит на экране.

# onboarding.keyboard.title
source: Make every shortcut unmistakable
de: Jedes Kürzel auf einen Blick
es: Haz que cada atajo sea inconfundible
fr: Rendez chaque raccourci évident
ru: Сделайте каждое сочетание понятным

# onboarding.later
source: Set Up Later
de: Später einrichten
es: Configurar más tarde
fr: Configurer plus tard
ru: Настроить позже

# onboarding.next
source: Continue
de: Weiter
es: Continuar
fr: Continuer
ru: Продолжить

# onboarding.permission.grant
source: Grant Access
de: Zugriff erlauben
es: Conceder acceso
fr: Autoriser l’accès
ru: Выдать доступ

# onboarding.permission.local
source: Keyboard events are processed only on this Mac.
de: Tastaturereignisse werden nur auf diesem Mac verarbeitet.
es: Los eventos del teclado se procesan solo en este Mac.
fr: Les événements clavier sont traités uniquement sur ce Mac.
ru: События клавиатуры обрабатываются только на этом Mac.

# onboarding.permission.retry
source: Try Again
de: Erneut versuchen
es: Volver a intentar
fr: Réessayer
ru: Попробовать снова

# onboarding.permission.secure
source: Secure Input automatically hides the keyboard overlay.
de: Secure Input blendet das Tastatur-Overlay automatisch aus.
es: Secure Input oculta automáticamente la superposición del teclado.
fr: Secure Input masque automatiquement la surcouche clavier.
ru: Secure Input автоматически скрывает оверлей клавиатуры.

# onboarding.permission.storage
source: Keystrokes are never recorded, stored, or transmitted.
de: Tastenanschläge werden nie aufgezeichnet, gespeichert oder übertragen.
es: Las pulsaciones nunca se graban, almacenan ni transmiten.
fr: Les frappes ne sont jamais enregistrées, stockées ni transmises.
ru: Нажатия никогда не записываются, не хранятся и не передаются.

# onboarding.permission.subtitle
source: Keypress needs one macOS permission to visualize keys outside the app.
de: Keypress benötigt eine macOS-Berechtigung, um Tasten außerhalb der App anzuzeigen.
es: Keypress necesita un permiso de macOS para mostrar teclas fuera de la app.
fr: Keypress a besoin d’une autorisation macOS pour afficher les touches hors de l’app.
ru: Keypress нужен один доступ macOS, чтобы показывать клавиши вне приложения.

# onboarding.permission.success
source: Input Monitoring is ready
de: Eingabemonitoring ist bereit
es: La monitorización de entrada está lista
fr: La surveillance des entrées est prête
ru: Мониторинг ввода готов

# onboarding.permission.title
source: Private by design
de: Privatsphäre als Grundprinzip
es: Privacidad desde el diseño
fr: Confidentiel par conception
ru: Приватность заложена в основу

# onboarding.permission.waiting
source: Waiting for access in System Settings…
de: Warten auf Zugriff in den Systemeinstellungen …
es: Esperando acceso en Ajustes del Sistema…
fr: En attente de l’accès dans Réglages Système…
ru: Ожидаем доступ в Системных настройках…

# onboarding.pointer.disabled
source: Halo is disabled — you can still finish setup
de: Halo ist aus — die Einrichtung kann trotzdem abgeschlossen werden
es: Halo está desactivado; aun así puedes terminar la configuración
fr: Halo est désactivé — vous pouvez terminer la configuration
ru: Halo выключен — настройку всё равно можно завершить

# onboarding.pointer.subtitle
source: Give movement and actions their own visual rhythm.
de: Gib Bewegungen und Aktionen einen eigenen visuellen Rhythmus.
es: Da a los movimientos y acciones su propio ritmo visual.
fr: Donnez aux mouvements et actions leur propre rythme visuel.
ru: Добавьте движению и действиям собственный визуальный ритм.

# onboarding.pointer.title
source: Let the pointer carry the audience
de: Der Zeiger führt dein Publikum
es: Deja que el puntero guíe a tu audiencia
fr: Laissez le pointeur guider votre public
ru: Пусть курсор ведёт внимание зрителя

# onboarding.preview.clicks
source: Clicks
de: Klicks
es: Clics
fr: Clics
ru: Клики

# onboarding.preview.hint
source: Try typing, moving the pointer, and clicking
de: Tippe, bewege den Zeiger und klicke
es: Prueba a escribir, mover el puntero y hacer clic
fr: Essayez de taper, déplacer le pointeur et cliquer
ru: Попробуйте печатать, двигать курсор и кликать

# onboarding.preview.keyboard
source: Keyboard
de: Tastatur
es: Teclado
fr: Clavier
ru: Клавиатура

# onboarding.preview.pointer
source: Pointer
de: Zeiger
es: Puntero
fr: Pointeur
ru: Курсор

# onboarding.preview.subtitle
source: Everything here is local. No permission is needed for this preview.
de: Alles hier ist lokal. Für diese Vorschau ist keine Berechtigung nötig.
es: Todo ocurre de forma local. Esta vista previa no necesita permisos.
fr: Tout se passe localement. Cet aperçu ne nécessite aucune autorisation.
ru: Всё работает локально. Для этого превью доступ не нужен.

# onboarding.preview.title
source: See what your audience will see
de: Sieh, was dein Publikum sieht
es: Mira lo que verá tu audiencia
fr: Voyez ce que votre public verra
ru: Посмотрите глазами вашей аудитории

# onboarding.progress
source: Step %d of %d
de: Schritt %d von %d
es: Paso %d de %d
fr: Étape %d sur %d
ru: Шаг %d из %d

# onboarding.settings.card.body
source: Finish the short guided setup to enable Keypress and tailor its overlays.
de: Schließe die kurze Einrichtung ab, um Keypress zu aktivieren und seine Overlays anzupassen.
es: Completa la breve configuración guiada para activar Keypress y personalizar sus superposiciones.
fr: Terminez la configuration guidée pour activer Keypress et personnaliser ses surcouches.
ru: Завершите короткую настройку, чтобы включить Keypress и подобрать вид оверлеев.

# onboarding.settings.card.title
source: Your setup is waiting
de: Deine Einrichtung wartet
es: Tu configuración está pendiente
fr: Votre configuration vous attend
ru: Настройка ждёт вас

# onboarding.settings.continue
source: Continue Setup
de: Einrichtung fortsetzen
es: Continuar configuración
fr: Continuer la configuration
ru: Продолжить настройку

# onboarding.settings.continue.subtitle
source: Return to the saved step
de: Zum gespeicherten Schritt zurückkehren
es: Volver al paso guardado
fr: Reprendre à l’étape enregistrée
ru: Вернуться к сохранённому шагу

# onboarding.settings.privacy
source: Private from the first key
de: Privat ab der ersten Taste
es: Privado desde la primera tecla
fr: Confidentiel dès la première touche
ru: Приватно с первого нажатия

# onboarding.settings.privacy.body
source: Input is processed locally and never recorded, stored, or transmitted. Keypress requests only Input Monitoring.
de: Eingaben werden lokal verarbeitet und nie aufgezeichnet, gespeichert oder übertragen. Keypress benötigt nur Eingabemonitoring.
es: La entrada se procesa localmente y nunca se graba, almacena ni transmite. Keypress solo solicita Monitorización de entrada.
fr: Les entrées sont traitées localement et ne sont jamais enregistrées, stockées ni transmises. Keypress demande uniquement la surveillance des entrées.
ru: Ввод обрабатывается локально и никогда не записывается, не хранится и не передаётся. Keypress запрашивает только Мониторинг ввода.

# onboarding.settings.progress
source: Saved progress
de: Gespeicherter Fortschritt
es: Progreso guardado
fr: Progression enregistrée
ru: Сохранённый прогресс

# onboarding.settings.status
source: Setup Status
de: Einrichtungsstatus
es: Estado de configuración
fr: État de la configuration
ru: Состояние настройки

# onboarding.settings.subtitle
source: Complete the guided setup when you are ready.
de: Schließe die geführte Einrichtung ab, wenn du bereit bist.
es: Completa la configuración guiada cuando quieras.
fr: Terminez la configuration guidée quand vous le souhaitez.
ru: Завершите пошаговую настройку, когда будете готовы.

# onboarding.settings.title
source: Setup
de: Einrichtung
es: Configuración
fr: Configuration
ru: Настройка

# onboarding.sound.off
source: Mute ceremony sound
de: Zeremonie stummschalten
es: Silenciar el sonido de bienvenida
fr: Couper le son d’accueil
ru: Выключить звук приветствия

# onboarding.sound.on
source: Turn ceremony sound on
de: Zeremonie-Ton einschalten
es: Activar el sonido de bienvenida
fr: Activer le son d’accueil
ru: Включить звук приветствия

# onboarding.start
source: Start Using Keypress
de: Keypress verwenden
es: Empezar a usar Keypress
fr: Commencer à utiliser Keypress
ru: Начать работу с Keypress

# onboarding.step.1
source: Interactive Preview
de: Interaktive Vorschau
es: Vista previa interactiva
fr: Aperçu interactif
ru: Интерактивное превью

# onboarding.step.2
source: Input Monitoring
de: Eingabemonitoring
es: Monitorización de entrada
fr: Surveillance des entrées
ru: Мониторинг ввода

# onboarding.step.3
source: Keyboard
de: Tastatur
es: Teclado
fr: Clavier
ru: Клавиатура

# sidebar.setup
source: Setup
de: Einrichtung
es: Configuración
fr: Configuration
ru: Настройка

# window.settings.title
source: Keypress Settings
de: Keypress-Einstellungen
es: Ajustes de Keypress
fr: Réglages de Keypress
ru: Настройки Keypress

# font.system
source: System
es: Sistema
fr: Système
ru: Системный

# about.link.community
source: GitHub Community
es: Comunidad de GitHub
fr: Communauté GitHub
ru: Сообщество на GitHub

# about.link.website
source: Website
es: Sitio web
fr: Site web
ru: Веб-сайт

# about.links
source: Links & Support
es: Enlaces y soporte
fr: Liens et assistance
ru: Ссылки и поддержка

# about.release.cursor.title
source: Cursor Halo
es: Halo del cursor
fr: Halo du curseur
ru: Подсветка курсора

# pointer.decoration
source: Detail
es: Detalle
fr: Détail
ru: Деталь

# onboarding.step.4
source: Cursor Halo
es: Halo del cursor
fr: Halo du curseur
ru: Подсветка курсора

# unit.points
source: pt
ru: пт

# pointer.lineStyle.aura
source: Aura
ru: Аура
